'''
Реализовать функцию get_jokes(), возвращающую n шуток, сформированных из трех
случайных слов, взятых из трёх списков (по одному из каждого):
nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
adjectives = ["веселый", "яркий", "зеленый", "утопичный",
"мягкий"]
Например:
get_jokes(2)
["лес завтра зеленый", "город вчера веселый"]
'''
import random


def get_jokes(number: int):
    # YOUR CODE HERE
    nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
    adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
    adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]
    for i in range(number):
        print(' '.join([random.choice(nouns), random.choice(adverbs), random.choice(adjectives)]))
    return  # YOUR CODE HERE


if __name__ == "__main__":
    print(get_jokes(2))
